prst/TM4C1294/TM4C1294_edu.c
//*****************************************************************************
//*****************************************************************************
// TM4C1294.c - Simple example to work with LEDs.
// This is start code of the EK-TM4C1294XL.
//*****************************************************************************
//*****************************************************************************

#include "TM4C1294_edu.h"
#include "time_delays.h"

//#include "inc/hw_types.h"
//#include "drivers/pinout.h"
//#include "driverlib/rom.h"
//#include "driverlib/rom_map.h"


/* *****************************************************************************
 * Global and system variables
 * ************************************************************************** */
t_Scheduler timer_leds5x8;
t_Scheduler timer_leds1on, timer_leds1off;
t_Scheduler timer_leds2on, timer_leds2off;
t_Scheduler timer_leds3on, timer_leds3off;
t_Scheduler timer_leds4on, timer_leds4off;
t_Scheduler timer_leds8x8;
t_Scheduler timer_keys;
t_Scheduler timer_fft;
t_Scheduler timer_rnd;

uint32_t  dly1 = 0;
uint32_t  dly2 = 0;
uint32_t  dly3 = 0;
uint32_t  dly4 = 0;
uint32_t  leds_position;

uint8_t   a_field [8][16];
uint8_t   a_field_eat [8][16];
uint8_t   a_field_eat_16b [16];

uint8_t   data [5] = { 1,  3,  5,  7,  9 };
uint8_t   datas[5] = {'1','3','5','7','9'};



/* *****************************************************************************
 *
 * ************************************************************************** */
void  drv_sys_init_gpio_output_input ( void );
void  drv_usr_init_led_7segments ( void );
void  drv_usr_init_led_8x8 ( void );
void  drv_led_7segments_clean ( void );
void  drv_led_7segments_position (unsigned char pos);
void  drv_led_7segments_symbol ( uint8_t position, uint8_t symbol, uint8_t comma );
t_ret_code keys_scan ( t_io_values *p_io );
t_ret_code keys_analyze ( t_io_values *p_io, t_sys_values *p_sys );
char *IntToStr(int i, char b[]);
char *FloatToLeds5x8(float ff, char b[]);
char *ultostr(unsigned long value, char *ptr, int base);
uint8_t *ftostr(float value, uint8_t *p_string, int base, uint8_t *p_comma);
t_ret_code algo_Snake ( t_io_values *p_io,  t_io_Snake *p_snake );


//******************************************************************************



/* *****************************************************************************
 * void drv_sys_init_gpio_output_input ( void )
 * Initialisation for GPIO, basic configuration and default startup settings.
 * ************************************************************************** */
void drv_sys_init_gpio_output_input ( void ) {
    volatile uint32_t ui32Loop;

/*  Datasheet @ page 757 @
Texas Instruments-Production Data @ Tiva TM4C1294NCPDT Microcontroller
Table 10-7. GPIO Register Map

Offset 	Name Type 	Reset 					Description page
0x000 	GPIODATA 	RW 		0x0000.0000 	GPIO Data 759
0x400 	GPIODIR 	RW 		0x0000.0000 	GPIO Direction 760
0x404 	GPIOIS 		RW 		0x0000.0000 	GPIO Interrupt Sense 761
0x408 	GPIOIBE 	RW 		0x0000.0000 	GPIO Interrupt Both Edges 762
0x40C 	GPIOIEV 	RW 		0x0000.0000 	GPIO Interrupt Event 763
0x410 	GPIOIM 		RW 		0x0000.0000 	GPIO Interrupt Mask 764
0x414 	GPIORIS 	RO 		0x0000.0000 	GPIO Raw Interrupt Status 765
0x418 	GPIOMIS 	RO 		0x0000.0000 	GPIO Masked Interrupt Status 767
0x41C 	GPIOICR 	W1C 	0x0000.0000 	GPIO Interrupt Clear 769
0x420 	GPIOAFSEL 	RW 		- 				GPIO Alternate Function Select 770
0x500 	GPIODR2R 	RW 		0x0000.00FF 	GPIO 2-mA Drive Select 772
0x504 	GPIODR4R 	RW 		0x0000.0000 	GPIO 4-mA Drive Select 773
0x508 	GPIODR8R 	RW 		0x0000.0000 	GPIO 8-mA Drive Select 774
0x50C 	GPIOODR 	RW 		0x0000.0000 	GPIO Open Drain Select 775
0x510 	GPIOPUR 	RW 		- 				GPIO Pull-Up Select 776
0x514 	GPIOPDR 	RW 		0x0000.0000 	GPIO Pull-Down Select 778
0x518 	GPIOSLR 	RW 		0x0000.0000 	GPIO Slew Rate Control Select 780
0x51C 	GPIODEN 	RW 		- 				GPIO Digital Enable 781
0x520 	GPIOLOCK 	RW 		0x0000.0001 	GPIO Lock 783
0x524 	GPIOCR 		- 		- 				GPIO Commit 784
0x528 	GPIOAMSEL 	RW 		0x0000.0000 	GPIO Analog Mode Select 786
0x52C 	GPIOPCTL 	RW 		- 				GPIO Port Control 787
0x530 	GPIOADCCTL 	RW 		0x0000.0000 	GPIO ADC Control 789
0x534 	GPIODMACTL 	RW 		0x0000.0000 	GPIO DMA Control 790
0x538 	GPIOSI 		RW 		0x0000.0000 	GPIO Select Interrupt 791
0x53C 	GPIODR12R 	RW 		0x0000.0000 	GPIO 12-mA Drive Select 792
0x540 	GPIOWAKEPEN RW 		0x0000.0000 	GPIO Wake Pin Enable 793
0x544 	GPIOWAKELVL RW 		0x0000.0000 	GPIO Wake Level 795
0x548 	GPIOWAKESTAT RO 	0x0000.0000 	GPIO Wake Status 797
0xFC0 	GPIOPP 		RO 		0x0000.0001 	GPIO Peripheral Property 799
0xFC4 	GPIOPC 		RW 		0x0000.0000 	GPIO Peripheral Configuration 800
0xFD0 	GPIOPeriphID4 RO 	0x0000.0000 	GPIO Peripheral Identification 4 803
0xFD4 	GPIOPeriphID5 RO 	0x0000.0000 	GPIO Peripheral Identification 5 804
0xFD8 	GPIOPeriphID6 RO 	0x0000.0000 	GPIO Peripheral Identification 6 805
0xFDC 	GPIOPeriphID7 RO 	0x0000.0000 	GPIO Peripheral Identification 7 806
0xFE0 	GPIOPeriphID0 RO 	0x0000.0061 	GPIO Peripheral Identification 0 807
0xFE4 	GPIOPeriphID1 RO 	0x0000.0000 	GPIO Peripheral Identification 1 808
0xFE8 	GPIOPeriphID2 RO 	0x0000.0018 	GPIO Peripheral Identification 2 809
0xFEC 	GPIOPeriphID3 RO 	0x0000.0001 	GPIO Peripheral Identification 3 810
0xFF0 	GPIOPCellID0 RO 	0x0000.000D 	GPIO PrimeCell Identification 0 811
0xFF4 	GPIOPCellID1 RO 	0x0000.00F0 	GPIO PrimeCell Identification 1 812
0xFF8 	GPIOPCellID2 RO 	0x0000.0005 	GPIO PrimeCell Identification 2 813
0xFFC 	GPIOPCellID3 RO 	0x0000.00B1 	GPIO PrimeCell Identification 3 814 */

    // Enable the GPIO port that is used for the on-board LED.
    SYSCTL_RCGCGPIO_R =
		SYSCTL_RCGCGPIO_R14 | //SYSCTL_RCGCGPIO_R14=GPIO Port Q Run Mode Clock
		SYSCTL_RCGCGPIO_R13 | //SYSCTL_RCGCGPIO_R13=GPIO Port P Run Mode Clock
    	SYSCTL_RCGCGPIO_R12 | //SYSCTL_RCGCGPIO_R12=GPIO Port N Run Mode Clock
		SYSCTL_RCGCGPIO_R11 | //SYSCTL_RCGCGPIO_R11=GPIO Port M Run Mode Clock
    	SYSCTL_RCGCGPIO_R10 | //SYSCTL_RCGCGPIO_R10=GPIO Port L Run Mode Clock
    	SYSCTL_RCGCGPIO_R9  | //SYSCTL_RCGCGPIO_R9= GPIO Port K Run Mode Clock
    	SYSCTL_RCGCGPIO_R8  | //SYSCTL_RCGCGPIO_R8= GPIO Port J Run Mode Clock
    	SYSCTL_RCGCGPIO_R7  | //SYSCTL_RCGCGPIO_R7= GPIO Port H Run Mode Clock
    	SYSCTL_RCGCGPIO_R6  | //SYSCTL_RCGCGPIO_R6= GPIO Port G Run Mode Clock
    	SYSCTL_RCGCGPIO_R5  | //SYSCTL_RCGCGPIO_R5= GPIO Port F Run Mode Clock
    	SYSCTL_RCGCGPIO_R4  | //SYSCTL_RCGCGPIO_R4= GPIO Port E Run Mode Clock
    	SYSCTL_RCGCGPIO_R3  | //SYSCTL_RCGCGPIO_R3= GPIO Port D Run Mode Clock
    	SYSCTL_RCGCGPIO_R2  | //SYSCTL_RCGCGPIO_R2= GPIO Port C Run Mode Clock
    	SYSCTL_RCGCGPIO_R1  | //SYSCTL_RCGCGPIO_R1= GPIO Port B Run Mode Clock
    	SYSCTL_RCGCGPIO_R0  ; //SYSCTL_RCGCGPIO_R0= GPIO Port A Run Mode Clock

    // Do a dummy read to insert a few cycles after enabling the peripheral.
    ui32Loop = SYSCTL_RCGCGPIO_R;

