prst/TM4C1294/TM4C1294_edu.c
    // Enable the GPIO port that is used for the on-board Inputs.
    SYSCTL_RCGCGPIO_R =
    	SYSCTL_RCGCGPIO_R10 | //SYSCTL_RCGCGPIO_R10=GPIO Port L Run Mode Clock
    	SYSCTL_RCGCGPIO_R8  | //SYSCTL_RCGCGPIO_R8= GPIO Port J Run Mode Clock
    	SYSCTL_RCGCGPIO_R6  | //SYSCTL_RCGCGPIO_R6= GPIO Port G Run Mode Clock
		SYSCTL_RCGCGPIO_R5  ; //SYSCTL_RCGCGPIO_R5= GPIO Port F Run Mode Clock

    // Do a dummy read to insert a few cycles after enabling the peripheral.
    ui32Loop = SYSCTL_RCGCGPIO_R;

    // ..................................
    // Enable the GPIO pin for the SW0 (PJ0).
    // Set the direction as input, and enable the GPIO pin for digital function.
    GPIO_PORTJ_AHB_DIR_R &=~0x03;
    GPIO_PORTJ_AHB_DEN_R |= 0x03; // SW0 and SW1: 0x01 and 0x02
    GPIO_PORTJ_AHB_PUR_R |= 0x03; // Pull-Up Resistor
    GPIO_PORTJ_AHB_PP_R   = 1;
    GPIO_PORTJ_AHB_PC_R   = 3;

    /*// Set the direction as input, and enable the GPIO pin for digital function.
    // Inputs on Port F
    GPIO_PORTF_AHB_DIR_R &=~(1<<3|1<<2|1<<1);
    GPIO_PORTF_AHB_DEN_R |= (1<<3|1<<2|1<<1); //
    GPIO_PORTF_AHB_PUR_R |= (1<<3|1<<2|1<<1); // Pull-Up Resistor
    GPIO_PORTF_AHB_PP_R   = 1;
    GPIO_PORTF_AHB_PC_R   = 3;

    // Inputs on Port F
    GPIO_PORTG_AHB_DIR_R &=~(1<<0);
    GPIO_PORTG_AHB_DEN_R |= (1<<0); //
    GPIO_PORTG_AHB_PUR_R |= (1<<0); // Pull-Up Resistor
    GPIO_PORTG_AHB_PP_R   = 1;
    GPIO_PORTG_AHB_PC_R   = 3;

    // Inputs on Port F
    GPIO_PORTL_DIR_R &=~(1<<5|1<<4);
    GPIO_PORTL_DEN_R |= (1<<5|1<<4); //
    GPIO_PORTL_PUR_R |= (1<<5|1<<4); // Pull-Up Resistor
    GPIO_PORTL_PP_R   = 1;
    GPIO_PORTL_PC_R   = 3;*/
}



/* *****************************************************************************
 * void drv_led_7segments_init ( void )
 * Initialisation for leds on board, basic configuration and default startup
 * settings.
 * ************************************************************************** */
void drv_usr_init_led_7segments ( void ) {
    // Initial 7-segments
    GPIO_PORTA_AHB_DIR_R  = 0xFF;  GPIO_PORTA_AHB_DEN_R = 0xFF;
    GPIO_PORTA_AHB_PP_R   = 1;
    GPIO_PORTA_AHB_PC_R   = 3;
    GPIO_PORTA_AHB_DR12R_R|=1; GPIO_PORTA_AHB_DR8R_R|=1; GPIO_PORTA_AHB_DR4R_R|=1;

    GPIO_PORTB_AHB_DIR_R  = 0xFF;  GPIO_PORTB_AHB_DEN_R = 0xFF;
    GPIO_PORTB_AHB_PP_R   = 1;
    GPIO_PORTB_AHB_PC_R   = 3;
    GPIO_PORTB_AHB_DR12R_R|=1; GPIO_PORTB_AHB_DR8R_R|=1; GPIO_PORTB_AHB_DR4R_R|=1;

    GPIO_PORTK_DIR_R  = 0xFF;  GPIO_PORTK_DEN_R = 0xFF;
    GPIO_PORTK_PP_R   = 1;
    GPIO_PORTK_PC_R   = 3;
    GPIO_PORTK_DR12R_R|=1; GPIO_PORTK_DR8R_R|=1; GPIO_PORTK_DR4R_R|=1;

    GPIO_PORTP_DIR_R  = 0xFF;  GPIO_PORTP_DEN_R = 0xFF;
    GPIO_PORTP_PP_R   = 1;
    GPIO_PORTP_PC_R   = 3;
    GPIO_PORTP_DR12R_R|=1; GPIO_PORTP_DR8R_R|=1; GPIO_PORTP_DR4R_R|=1;

    GPIO_PORTM_DIR_R = 0xFF;  GPIO_PORTM_DEN_R = 0xFF;
    GPIO_PORTM_PP_R    = 1;
    GPIO_PORTM_PC_R    = 3;
    GPIO_PORTM_DR12R_R|=1; GPIO_PORTM_DR8R_R|=1; GPIO_PORTM_DR4R_R|=1;

    GPIO_PORTQ_DIR_R  = 0xFF;  GPIO_PORTQ_DEN_R = 0xFF;
    GPIO_PORTQ_PP_R   = 1;
    GPIO_PORTQ_PC_R   = 3;
    GPIO_PORTQ_DR12R_R|=1; GPIO_PORTQ_DR8R_R|=1; GPIO_PORTQ_DR4R_R|=1;

    // PQ2, PA3, also PQ3, PA2 are use one pins
    GPIO_PORTA_AHB_DIR_R &= ~((1<<2)|(1<<3));
    GPIO_PORTA_AHB_DIR_R &= ~((1<<2)|(1<<3));
}
//******************************************************************************



/* *****************************************************************************
 * void drv_usr_init_led_8x8 ( void )
 * Initialisation for leds on board, basic configuration and default startup
 * settings.
 * ************************************************************************** */
void drv_usr_init_led_8x8 ( void ) {
    // Initial 7-segments
    GPIO_PORTC_AHB_DIR_R   = 0xFF;  GPIO_PORTC_AHB_DEN_R = 0xFF;
    GPIO_PORTC_AHB_PP_R    = 1;
    GPIO_PORTC_AHB_PC_R    = 3;
    GPIO_PORTC_AHB_DR12R_R|= 1; GPIO_PORTC_AHB_DR8R_R |= 1; GPIO_PORTC_AHB_DR4R_R |= 1;

    GPIO_PORTD_AHB_DIR_R   = 0xFF;  GPIO_PORTD_AHB_DEN_R = 0xFF;
    GPIO_PORTD_AHB_PP_R    = 1;
    GPIO_PORTD_AHB_PC_R    = 3;
    GPIO_PORTD_AHB_DR12R_R|= 1; GPIO_PORTD_AHB_DR8R_R |= 1; GPIO_PORTD_AHB_DR4R_R |= 1;

    GPIO_PORTE_AHB_DIR_R   = 0xFF;  GPIO_PORTE_AHB_DEN_R = 0xFF;
    GPIO_PORTE_AHB_PP_R    = 1;
    GPIO_PORTE_AHB_PC_R    = 3;
    GPIO_PORTE_AHB_DR12R_R|= 1; GPIO_PORTE_AHB_DR8R_R |= 1; GPIO_PORTE_AHB_DR4R_R |= 1;

    GPIO_PORTH_AHB_DIR_R   = 0xFF;  GPIO_PORTH_AHB_DEN_R = 0xFF;
    GPIO_PORTH_AHB_PP_R    = 1;
    GPIO_PORTH_AHB_PC_R    = 3;
    GPIO_PORTH_AHB_DR12R_R|= 1; GPIO_PORTH_AHB_DR8R_R |= 1; GPIO_PORTH_AHB_DR4R_R |= 1;

    GPIO_PORTN_DIR_R       = 0xFF;  GPIO_PORTN_DEN_R = 0xFF;
    GPIO_PORTN_PP_R        = 1;
    GPIO_PORTN_PC_R        = 3;
    GPIO_PORTN_DR12R_R    |= 1; GPIO_PORTN_DR8R_R |= 1; GPIO_PORTN_DR4R_R |= 1;
}
//******************************************************************************



/* *****************************************************************************
 * void drv_led_7segments_position (unsigned char pos)
 * Initialisation for Possition in leds on 7 segments indicator, basic
 * configuration and default startup settings.
 * ************************************************************************** */
void  drv_led_7segments_clean ( void ) {

	GPIO_PORTA_AHB_DATA_R |=  (1<<2); // Anod (Common) 0
	GPIO_PORTA_AHB_DATA_R |=  (1<<3); // Anod (Common) 1
	GPIO_PORTK_DATA_R     |=  (1<<3); // Anod (Common) 2
	GPIO_PORTP_DATA_R     |=  (1<<3); // Anod (Common) 3
	GPIO_PORTM_DATA_R     |=  (1<<6); // Anod (Common) 4

    // Data to 7-segments
	GPIO_PORTK_DATA_R     |=  (1<<2); // Cathod - A
	GPIO_PORTA_AHB_DATA_R |=  (1<<4); // Cathod - B
	GPIO_PORTK_DATA_R     |=  (1<<1); // Cathod - C
	GPIO_PORTB_AHB_DATA_R |=  (1<<5); // Cathod - D
	GPIO_PORTB_AHB_DATA_R |=  (1<<4); // Cathod - E
	GPIO_PORTK_DATA_R     |=  (1<<3); // Cathod - F
	GPIO_PORTA_AHB_DATA_R |=  (1<<5); // Cathod - G
	GPIO_PORTK_DATA_R     |=  (1<<0); // Cathod - H}
}
//******************************************************************************



/* *****************************************************************************
 * void drv_led_7segments_position (unsigned char pos)
 * Initialisation for Possition in leds on 7 segments indicator, basic
 * configuration and default startup settings.
 * ************************************************************************** */
void drv_led_7segments_position (unsigned char pos) {
	/*
	GPIO_PORTA_AHB_DATA_R |=  (1<<2); // Anod (Common) 0
	GPIO_PORTA_AHB_DATA_R |=  (1<<3); // Anod (Common) 1
	GPIO_PORTK_DATA_R     |=  (1<<3); // Anod (Common) 2
	GPIO_PORTP_DATA_R     |=  (1<<3); // Anod (Common) 3
	GPIO_PORTM_DATA_R     |=  (1<<6); // Anod (Common) 4
	*/
	switch ( pos ) {
		case 0: _LEDS_POS_I_SET; _LEDS_POS_II_CLR; _LEDS_POS_III_CLR; _LEDS_POS_IV_CLR; _LEDS_POS_V_CLR; break;
		case 1: _LEDS_POS_I_CLR; _LEDS_POS_II_SET; _LEDS_POS_III_CLR; _LEDS_POS_IV_CLR; _LEDS_POS_V_CLR; break;
		case 2: _LEDS_POS_I_CLR; _LEDS_POS_II_CLR; _LEDS_POS_III_SET; _LEDS_POS_IV_CLR; _LEDS_POS_V_CLR; break;
		case 3: _LEDS_POS_I_CLR; _LEDS_POS_II_CLR; _LEDS_POS_III_CLR; _LEDS_POS_IV_SET; _LEDS_POS_V_CLR; break;
		case 4: _LEDS_POS_I_CLR; _LEDS_POS_II_CLR; _LEDS_POS_III_CLR; _LEDS_POS_IV_CLR; _LEDS_POS_V_SET; break;
	}
}
//******************************************************************************



/* *****************************************************************************
 *
 * ************************************************************************** */
void drv_led_7segments_symbol ( uint8_t position, uint8_t symbol, uint8_t comma ) {
    // Data to 7-segments
	GPIO_PORTK_DATA_R     |=  (1<<2); // Cathod - A
	GPIO_PORTA_AHB_DATA_R |=  (1<<4); // Cathod - B
	GPIO_PORTK_DATA_R     |=  (1<<1); // Cathod - C
	GPIO_PORTB_AHB_DATA_R |=  (1<<5); // Cathod - D
	GPIO_PORTB_AHB_DATA_R |=  (1<<4); // Cathod - E
	GPIO_PORTK_DATA_R     |=  (1<<3); // Cathod - F
	GPIO_PORTA_AHB_DATA_R |=  (1<<5); // Cathod - G
	GPIO_PORTK_DATA_R     |=  (1<<0); // Cathod - H

	if ( symbol==0x0D ) symbol = '-';

	switch ( symbol ) {
		case '-':
			//GPIO_PORTK_DATA_R     |=  (1<<2); // Cathod - A
			//GPIO_PORTA_AHB_DATA_R |=  (1<<4); // Cathod - B
			//GPIO_PORTK_DATA_R     |=  (1<<1); // Cathod - C
			//GPIO_PORTB_AHB_DATA_R |=  (1<<5); // Cathod - D
			//GPIO_PORTB_AHB_DATA_R |=  (1<<4); // Cathod - E
			//GPIO_PORTK_DATA_R     |=  (1<<3); // Cathod - F
			GPIO_PORTA_AHB_DATA_R &= ~(1<<5); // Cathod - G
			//GPIO_PORTK_DATA_R     |=  (1<<0); // Cathod - H
		break;

		case 0:
		case '0':
			GPIO_PORTK_DATA_R     &= ~(1<<2); // Cathod - A
			GPIO_PORTA_AHB_DATA_R &= ~(1<<4); // Cathod - B
			GPIO_PORTK_DATA_R     &= ~(1<<1); // Cathod - C
			GPIO_PORTB_AHB_DATA_R &= ~(1<<5); // Cathod - D
			GPIO_PORTB_AHB_DATA_R &= ~(1<<4); // Cathod - E
			GPIO_PORTK_DATA_R     &= ~(1<<3); // Cathod - F
			//GPIO_PORTA_AHB_DATA_R |=  (1<<5); // Cathod - G
			//GPIO_PORTK_DATA_R     |=  (1<<0); // Cathod - H
		break;

		case 1:
		case '1':
			//GPIO_PORTK_DATA_R     |=  (1<<2); // Cathod - A
			GPIO_PORTA_AHB_DATA_R &= ~(1<<4); // Cathod - B
			GPIO_PORTK_DATA_R     &= ~(1<<1); // Cathod - C
			//GPIO_PORTB_AHB_DATA_R |=  (1<<5); // Cathod - D
			//GPIO_PORTB_AHB_DATA_R |=  (1<<4); // Cathod - E
			//GPIO_PORTK_DATA_R     |=  (1<<3); // Cathod - F - symbol 2 common?
			//GPIO_PORTA_AHB_DATA_R |=  (1<<5); // Cathod - G
			//GPIO_PORTK_DATA_R     |=  (1<<0); // Cathod - H
		break;

