prst/TM4C1294/TM4C1294_edu.c
//******************************************************************************



/* *****************************************************************************
 *
 * ************************************************************************** */
t_ret_code keys_scan ( t_io_values *p_io )
{
	t_ret_code rc = RC_FAILED;

	// Check input pointers
	if ( p_io==NULL ) return RC_PTR_FAIL;

	rc = RC_OK;

	if ( GPIO_PORTF_AHB_DATA_R & (1<<1) ) { p_io->keys.k5=0; } else { p_io->keys.k5=1; }
	if ( GPIO_PORTF_AHB_DATA_R & (1<<2) ) { p_io->keys.k4=0; } else { p_io->keys.k4=1; }
	if ( GPIO_PORTF_AHB_DATA_R & (1<<3) ) { p_io->keys.k3=0; } else { p_io->keys.k3=1; }
	if ( GPIO_PORTG_AHB_DATA_R & (1<<0) ) { p_io->keys.k2=0; } else { p_io->keys.k2=1; }
	if ( GPIO_PORTL_DATA_R & (1<<4)     ) { p_io->keys.k1=0; } else { p_io->keys.k1=1; }
	if ( GPIO_PORTL_DATA_R & (1<<5)     ) { p_io->keys.k0=0; } else { p_io->keys.k0=1; }

	if ( (GPIO_PORTJ_AHB_DATA_R & 0x03) == BTN_PCS_0 ) {
		if ( p_io->in<99999 )
		if ( p_io->in<1 ) p_io->in += 0.0001; else
		if ( p_io->in<10 ) p_io->in += 0.001; else
		if ( p_io->in<100 ) p_io->in += 0.01; else
		if ( p_io->in<1000 ) p_io->in += 0.1; else
		if ( p_io->in<10000 ) p_io->in +=  1;

		if ( ++p_io->x>7 ) p_io->x=0;
		//srand ( p_io->x *100 );
	}
	if ( (GPIO_PORTJ_AHB_DATA_R & 0x03) == BTN_PCS_1 ) {
		if ( p_io->in>0 )
		if ( p_io->in<1 ) p_io->in -= 0.0001; else
		if ( p_io->in<10 ) p_io->in -= 0.001; else
		if ( p_io->in<100 ) p_io->in -= 0.01; else
		if ( p_io->in<1000 ) p_io->in -= 0.1; else
		if ( p_io->in<10000 ) p_io->in -=  1;

		if ( ++p_io->y>15 ) p_io->y=0;
		//srand ( p_io->y *100 );
	}

	return rc;
}
//******************************************************************************



/* *****************************************************************************
 *
 * ************************************************************************** */
t_ret_code keys_analyze ( t_io_values *p_io, t_sys_values *p_sys ) {
t_ret_code rc = RC_FAILED;

	// Check input pointers
	if ( p_io==NULL | p_sys==NULL ) return RC_PTR_FAIL;

	rc = RC_OK;

	p_sys->key0 =0;
	p_sys->key1 =0;
	p_sys->key2 =0;
	p_sys->key3 =0;
	p_sys->key4 =0;
	p_sys->key5 =0;

	if ( p_io->keys.k0 ) p_sys->key0 =1;
	if ( p_io->keys.k1 ) p_sys->key1 =1;
	if ( p_io->keys.k2 ) p_sys->key2 =1;
	if ( p_io->keys.k3 ) p_sys->key3 =1;
	if ( p_io->keys.k4 ) p_sys->key4 =1;
	if ( p_io->keys.k5 ) p_sys->key5 =1;

	return rc;
}
//******************************************************************************



/* *****************************************************************************
 * Number in to string converter (itoa)
 * ************************************************************************** */
char* IntToStr(int i, char b[]) {
    char const digit[] = "0123456789";
    char* p = b;
    if(i<0){
        *p++ = '-';
        i *= -1;
    }
    int shifter = i;
    do{ //Move to where representation ends
        ++p;
        shifter = shifter/10;
    }while(shifter);
    *p = '\0';
    do{ //Move back, inserting digits as u go
        *--p = digit[i%10];
        i = i/10;
    }while(i);
    return b;
}
//******************************************************************************



/* *****************************************************************************
 * Number in to string converter
 * ************************************************************************** */
// itoa
char* FloatToLeds5x8(float ff, char b[]) {
    char const digit[] = "0123456789";
    char *p = b;
    int shifter=0, i=0, pos=0, stepen=0, mux=0, in1=0;
    float ostatok;

    ostatok = ff-(int)ff;
    if (ostatok<0) ostatok*=-1;
    if (ostatok<0.0001) ostatok*=10000000;
    if (ostatok<0.001) ostatok*=1000000;
    if (ostatok<0.01) ostatok*=100000;
    if (ostatok<0.1) ostatok*=10000;
    if (ostatok<1) ostatok*=1000;

    i = ff;
    in1 = (int)ff;

	for (pos=0; pos<5; pos++) {
		switch (pos){
			case 0: mux=0; break;
			case 1: mux=10; break;
			case 2: mux=100; break;
			case 3: mux=1000; break;
			case 4: mux=10000; break;
			case 5: mux=100000; break;
		}
		for ( stepen=0; (uint16_t)(in1-(stepen*mux))<mux; stepen++ ) {
			if (stepen<pos) {
				b[pos]=stepen;
			}
		}
    }

    if (i<0) {
        *p++ = '-';
        i *= -1;
    }

    shifter = i;

    do { //Move to where representation ends
        ++p;
        shifter = shifter/10;
        *p = shifter;
    } while (shifter) ;

    //*p = '\0';
    *p = '.';

    do { //Move to where representation ends
        ++p;
        ostatok = ostatok/10;
        *p = ostatok;
    } while ((int)ostatok) ;

    do{ //Move back, inserting digits as u go
        *--p = digit[i%10];
        i = i/10;
    }while(i);

    return b;
}
//******************************************************************************



/* *****************************************************************************
 *
 * ************************************************************************** */
char *ultostr(unsigned long value, char *ptr, int base)
{
  unsigned long t = 0, res = 0;
  unsigned long tmp = value;
  int count = 0;

  if (NULL == ptr) {
    return NULL;
  }

  if (tmp == 0) {
    count++;
  }

  while(tmp > 0) {
    tmp = tmp/base;
    count++;
  }

  ptr += count;
  *ptr = '\0';

  do {
    res = value - base * (t = value / base);
    if (res < 10) {
      * -- ptr = '0' + res;
    } else
    if ((res >= 10) && (res < 16)) {
        * --ptr = 'A' - 10 + res;
    }
  } while ((value = t) != 0);

  return(ptr);
}
//******************************************************************************



/* *****************************************************************************
 *
 * ************************************************************************** */
uint8_t *ftostr(float value, uint8_t *p_string, int base, uint8_t *p_comma)
{
  unsigned long t=0;
  unsigned long res=0;
  unsigned long val=0;
  float         ostatok_float=0;
  uint32_t      celoe=0, ostatok_int=0;
  uint8_t       dlina_ostatka=0;

  if (NULL == p_string) {
    return NULL;
  }

  if (NULL == p_comma) {
    return NULL;
  }

  celoe = (int)value;
  ostatok_float = value - celoe;

