prst/TM4C1294/TM4C1294_edu.c
  if (celoe<1) {
	  *p_comma=0;
		ostatok_int = (uint32_t)((ostatok_float * 10000));
		dlina_ostatka = 5 - (*p_comma);
		p_string += 0;
  } else
  if (celoe<10) {
	  *p_comma=0;
		ostatok_int = (uint32_t)((ostatok_float * 10000));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 1;
  } else
  if (celoe<100) {
	  *p_comma=1;
		ostatok_int = (uint32_t)((ostatok_float * 1000));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 2;
  } else
  if (celoe<1000) {
	  *p_comma=2;
		ostatok_int = (uint32_t)((ostatok_float * 100));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 3;
  } else
  if (celoe<10000) {
	  *p_comma=3;
		ostatok_int = (uint32_t)((ostatok_float * 10));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 4;
  } else
  if (celoe<100000) {
	  *p_comma=4;
		ostatok_int = (uint32_t)((ostatok_float * 1));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 5;
  } else
  if (celoe<1000000) {
	  *p_comma=4;
		ostatok_int = (uint32_t)((ostatok_float * 0));
		dlina_ostatka = 5 - (*p_comma+1);
		p_string += 6;
  }

  val = value;

  do {  // display - Celoe
	t = val / base;
    res = val - base * t; // res = drobnaya ot value
    if (res < 10) {
      *--p_string = '0' + res;
    }
  } while ((val = t) != 0);

  if (celoe<1) { p_string += 5;  }     else
  if (celoe<10) { p_string += 4; }     else
  if (celoe<100) { p_string += 4; }    else
  if (celoe<1000) { p_string += 4; }   else
  if (celoe<10000) { p_string += 4; }  else
  if (celoe<100000) { p_string += 4; } else
  if (celoe<1000000) { p_string += 4; }

  if (*p_comma<5) { // Display - Ostatok
	  do {
	    if (dlina_ostatka>0) {
			t = ostatok_int / base;
			res = ostatok_int - base * t; // res = drobnaya ot value
			if (res < 10) {
			  *p_string-- = '0' + res;
			}
	      dlina_ostatka--;
	    }
	  } while ( (ostatok_int=t)!=0 || dlina_ostatka!=0 );
  }

  return (p_string);
}
//******************************************************************************





extern int snake_main ( void ) ;

extern uint32_t  u32_rtc_time;
extern uint32_t  u32_rtc_date;


t_io_values  io  = {0};
t_sys_values sys = {0};
t_io_Snake   s_snake = { .algo_step = S_INIT };

/* *****************************************************************************
 * Blinks on the leds and indicator.
 * ************************************************************************** */
int main (void) {
    uint8_t     rc=1;
    uint8_t     comma;
    uint8_t    *p_str=0;

    volatile uint32_t  pos;
    volatile uint32_t  cnt=0;

    drv_sys_init_gpio_output_input ();
    drv_usr_init_led_7segments ();
    drv_usr_init_led_8x8 ();
    drv_usr_init_rtc ();
    drv_usr_init_scheduler_and_all_timers ();

    leds_position = 1;
    io.in = 0.0001; // Set to default value

	while(1) { // Loop forever.
	//	drv_led_blink (); // timer_leds4on.common_rule

		//if (sys.key_pressed==0)
		//	drv_led_7segments_clean();
		//else
		if ( _TIMER_READY == delay_timer_leds5x8('?') ) {
			if ( pos < 5 ) {
				p_str = ftostr ( io.in, data, 10, &comma ); // value, *ptr, base, *comma
				if (p_str!=NULL) {
					drv_led_7segments_symbol ( pos, data[pos], comma ); // display info
					drv_led_7segments_position ( pos ); // dinamic switching
					//drv_led_8x8_pixel_set ( io.x, io.y, 0 ); // display info
				}
				pos++;
				cnt++;
    		}
			if (pos>=5) pos=0;
    	}

		if ( _TIMER_READY == delay_timer_keys ('?') ) {
			keys_scan ( &io );
			keys_analyze ( &io, &sys );
			if ( sys.key0 ||sys.key1 ||sys.key2 ||sys.key3 ||sys.key4 ||sys.key5 ) {
				sys.key_pressed=1;
				if (sys.key5) { if ( io.in < 99999 ) io.in += 0.001; }
				if (sys.key4) { if ( io.in > 0 )     io.in -= 0.001; }
				if (sys.key3) { if ( io.in < 99999 ) io.in += 0.01; }
				if (sys.key2) { if ( io.in > 0 )     io.in -= 0.01; }
				if (sys.key1) { if ( io.in < 99999 ) io.in += 0.1; }
				if (sys.key0) { if ( io.in > 0 )     io.in -= 0.1; }
				//srand ( (char)io.in ); // Initiate seek random number
				//s_snake.rnd = rnd_fill_field( (io.in)*100 );
			} else {
				sys.key_pressed=0;
			}
		}

		if ( _TIMER_READY == delay_timer_leds8x8('?') ) {
			//int rc;
			//rc = snake_main();

			if ( RC_OK != algo_Snake (&io, &s_snake) ) { error_forever_loop; }

			/*char  yy=0;
			float val=0;
			rc = fft_calc();
			if ( yy<16 ) {
				//val = abs(buf_out[yy]*10);
				if ( buf_out[yy] <0 ) {  val = -1*(buf_out[yy] * 10000);
				} else {                 val =    (buf_out[yy] * 10000); }
				drv_led_8x8_show_byte( (uint8_t)val, xx, yy );
				yy++;
			} else {
				yy=0;
			}*/
		}

		/*
		if ( _TIMER_READY == delay_timer_random_generator('?') ) {
			if ( ++io.rnd>7 ) io.rnd=0;

			//Read RTC Time
			u32_rtc_time = HIB_CAL0_R;

			//Read RTC Date
			u32_rtc_date = HIB_CAL1_R;
		}
		*/

	}
	return rc;
}
//******************************************************************************
